const lessons = [
  {
    id: 0,
    title: "آداب الاستنجاء وقضاء الحاجة",
    img: "./assets/images/images (4).jpeg",
    info: "لم يترك الشرع أمراً يواجهه المسلم إلا وضع له آداباً وضوابط، ومن هذه الأمور الآداب المتعلقة بقضاء الحاجة. ستتعرف في هذا الدرس على آداب قضاء الحاجة والاستنجاء، وأنواع الحدث، والطهارة لكل نوع",
    goals: [
      "معرفة آداب قضاء الحاجة والاستنجاء.",
      "معرفة أنواع الحدث.",
      "معرفة كيفية التَّطَهُّر من الحدث."
    ]
  },
  {
    id: 1,
    title: "الحدث الأكبر والغسل",
    img: "./assets/images/10.jpg",
    info: "شرع الإسلام الغُسْل للطهارة من الحدث الأكبر. ستتعرف في هذا الدرس على موجبات الغُسْل وكيفية التَّطَهُّر من الحدث الأكبر.",
    goals: [
      "معرفة موجبات الغُسْل.",
      "معرفة كيفية التَّطُهُّر من الحدث الأكبر."
    ]
  },
  {
    id: 2,
    title: "الوضوء",
    img: "./assets/images/سنن_وفرائض_الوضوء.jpg",
    info: "الوضوء والطهارة من أفضل الأعمال وأجلها. ستتعرف في هذا الدرس على فضل الوضوء وصفته.",
    goals: [
      "معرفة فضل الوضوء.",
      "التعرف على كيفية الوضوء."
    ]
  },
  {
    id: 3,
    title: "شروط الصلاة وحكمها",
    img: "./assets/images/images.jpeg",
    info: "للصلاة شروط لا تصح إلا بها، فوجب على المسلم الإحاطة بهذه الشروط. ستتعرف في هذا الدرس على شروط الصلاة، وحكمها ومكانها.",
    goals: [
      "معرفة شروط الصلاة.",
      "معرفة حكم الصلاة.",
      "التعرف على أحكام مكان إقامة الصلاة."
    ]
  },
  {
    id: 4,
    title: "معنى الصلاة وفضلها",
    img: "./assets/images/images (1).jpeg",
    info: "للصلاة منزلة عظيمة في الإسلام، وهي ركن من أركانه العظام، وركن أساسي في حياة المسلم. ستتعرف في هذا الدرس على معنى الصلاة، ومنزلتها وفضلها.",
    goals: [
      "معرفة معنى الصلاة.",
      "معرفة منزلة الصلاة في الإسلام.",
      "معرفة فضل الصلاة وأهميتها."
    ]
  },
  {
    id: 5,
    title: "معنى سورة الفاتحة",
    img: "./assets/images/images (2).jpeg",
    info: "قراءة سورة الفاتحة من أهم أركان الصلاة التي لا تقوم إلا بها. ستتعرف في هذا الدرس على معاني آيات هذه السورة العظيمة.",
    goals: [
      "التعرف على معاني آيات سورة الفاتحة.",
    ]
  },
  {
    id: 6,
    title: " صفة الصلاة",
    img: "./assets/images/images (3).jpeg",
    info: "بيَّنت الشريعة الطريقة الصحيحة لأداء الصلاة حتى تكون مقبولة عند الله عز وجل. ستتعرف في هذا الدرس على صفة الصلاة وكيفيتها.",
    goals: [
      "معرفة صفة الصلاة."
    ]
  },
  {
    id: 7,
    title: "اركان الصلاة وواجباتها, ومبطلاتها ومكروهاتها",
    img: "./assets/images/images (5).jpeg",
    info: "للصلاة أركان وواجبات لا تقوم إلا بها، ويطرأ عليها ما يبطلها. ستتعرف في هذا الدرس على أركان الصلاة وواجباتها، ومبطلاتها ومكروهاتها.",
    goals: [
      "معرفة أركان الصلاة.",
      "معرفة واجبات الصلاة.",
      "معرفة مبطلات الصلاة.",
      "التعرف على سجود السهو.",
      "معرفة مكروهات الصلاة."
    ]
  },
  {
    id: 8,
    title: "صلاة الجماعة",
    img: "./assets/images/images (6).jpeg",
    info: "فرض الله صلاة الجماعة على المسلمين لحِكَمٍ جليلةٍ وفوائدَ عديدةٍ. في هذا الدرس ستتعرف على صفة صلاة الجماعة وأحكامها.",
    goals: [
      "معرفة فضل صلاة الجماعة.",
      "التعرف على معنى الائتمام.",
      "التعرف على أحكام الإمام والمأموم."
    ]
  },
  {
    id: 9,
    title: " الزكاة؛ حقيقتها ومقاصدها",
    img: "./assets/images/images (7).jpeg",
    info: "الزكاة هي الركن الثالث من أركان الإسلام .ستتعرف في هذا الدرس على حقيقتها، ومقاصدها، والحِكمة من تشريعها.",
    goals: [
      "معرفة حقيقة الزكاة.",
      "معرفة المقاصد من تشريعها. ",
      "معرفة أصناف المستحقين للزكاة."
    ]
  },
  {
    id: 10,
    title: " صيام رمضان",
    img: "./assets/images/download (1).jpeg",
    info: "صيام شهر رمضان هو الركن الرابع من أركان الإسلام ومبانيه العظام. ستتعرف في هذا الدرس على معنى الصيام وفضله، وعلى فضل شهر رمضان.",
    goals: [
      "التعرف على معنى الصيام وفضله.",
      "التعرف على فضل شهر رمضان."
    ]
  },
  {
    id: 11,
    title: "شهادة أن لا إله إلا الله",
    img: "./assets/images/images (10).jpeg",
    info: "جعل الإسلام للشهادتين أشهد أن لا إله إلا الله وأشهد أن محمداً رسول الله أعظم المكانة وأجلها. ستتعرف في هذا الدرس على معنى شهادة أن لا إله إلا الله ومكانتها وأركانها. ",
    goals: [
      "التعرف على معنى شهادة أن لا إله إلا الله.",
      "التعرف على مكانة شهادة أن لا إله إلا الله.",
      "معرفة أركان شهادة أن لا إله إلا الله."
    ]
  },
  {
    id: 12,
    title: "معرفة النبي صلى الله عليه وسلم",
    img: "./assets/images/download (2).jpeg",
    info: "أرسل الله نبينا محمداً صلى الله عليه وسلم إلى الناس كافة بكل أجناسهم وأعراقهم. في هذا الدرس تعريف مختصر بالنبي صلى الله عليه وسلم.",
    goals: [
      "معرفة مختصر سيرة النبي محمد صلى الله عليه وسلم",
      "معرفة مكانة النبي صلى الله عليه وسلم"
    ]
  },
  {
    id: 13,
    title: "معنى الحج وفضائله",
    img: "./assets/images/images (11).jpeg",
    info: "الحج هو التعبد لله عز وجل بقصد مكة المكرمة في وقت محدد لأداء المناسك، وهو الركن الخامس من أركان الإسلام. ستتعرف في هذا الدرس على معنى الحج وفضائله.",
    goals: [
      "التعرف على معنى الحج.",
      "التعرف على شروط وجوب الحج.",
      "التعرف على فضائل الحج."
    ]
  },
  {
    id: 14,
    title: " فضائل القرآن الكريم",
    img: "./assets/images/download (3).jpeg",
    info: "للقرآن الكريم العديد من الفضائل التي تُبيِّن شرف هذا الكتاب العظيم ومكانته. وسوف تتعرف في هذا الدرس على عدد منها.",
    goals: [
      "التعرف على بعض فضائل القرآن الكريم."
    ]
  }
];
