//this is to get the topic name from the url to know which data to get
const params = new URLSearchParams(window.location.search);
const topic = params.get("topic");

let article_title = {};
let articles_cards = [];

function showArticle(topicName) {
  //making sure theyre empty
  article_title = {};
  articles_cards = [];
  //=============================al3badat data =======================
  if (topicName === 'al3badat') {
    article_title = {
      title: "العبادات",
      description: "يهدف هذا الفرع إلى تأصيل العبادات وترسيخها، وربط العبادة وأحكامها بالكتاب الكريم والسنة النبوية المطهرة. ويتناول فقه العبادات أحكام العبادات المكلف بها الإنسان بالتوضيح والتفصيل كما وردت عن النبي محمد ﷺ وعن صحابته رضي الله عنهم أجمعين."
    }

    articles_cards = [
      {
        title: "الطهارة",
        description: "الصلاة هي ركن الإسلام الثاني بعد الشهادتين، ولما كانت الصلاة لا تصح بدون طهارة، كان من المناسب أن يبدأ الطالب بتعلم أحكام الطهارة لتصح صلاته.",
        img: "assets/img/3badat1.jpeg",
      },
      {
        title: "الصلاة",
        description: "الصلاة هي عماد الدين وهي أهم ما يجب البدء بتعلمه من العبادات، فهي ثاني أركان الدين الإسلامي بعد الشهادتين ",
        img: "assets/img/3badat2.jpeg",
      },
      {
        title: "الزكاة",
        description: "الزكاة هي الركن الثالث من أركان الإسلام، فرضها الله لتزكي المعطي والآخذ وتطهرهما، ولئن كانت في ظاهرها نقصاً في كمية المال إلا أن من آثارها زيادة المال بركة، وزيادة المال كمية، وزيادة الإيمان في قلب صاحبها.",
        img: "assets/img/3badat3.jpeg",
      },
      {
        title: "الصوم",
        description: "صوم رمضان هو الركن الرابع من أركان الإسلام، والصوم عبادة جليلة، فرضها الله على المسلمين كما فرضها على الأمم السابقة لتحصيل التقوى التي هي مفتاح كل خير.",
        img: "assets/img/3badat4.jpeg",
      },
      {
        title: "الحج",
        description: "الحج هو الركن الخامس من أركان الإسلام، ويجب على المسلم البالغ القادر مرة واحدة في العمر.",
        img: "assets/img/3badat5.jpeg",
      },
      {
        title: "الموت و الجنازة",
        description: "الموت ليس نهاية الأمر ولكنه مرحلة جديدة للإنسان وبداية للحياة الكاملة في الآخرة وكما حرص الإسلام على رعاية الحقوق منذ الولادة فقد أكد على الأحكام التي تحفظ حقوق الميت وتراعي حال أهله وأقاربه.",
        img: "assets/img/3badat6.jpg",
      }
    ];
  } 
  //====================================almunasbat data ========================
  else if (topicName === 'almunasbat') {
    article_title = {
      title: "المناسبات",
      description: "الإسلام دين شامل لكل ما فيه الخير للإنسان، وهو رسالة عامة للإنسان أينما كان، ووقتما كان، فكما هو شامل وعام، فهو صالح لكل مكان وزمان. يشمل هذا القسم موضوعات منتقاة يحتاجها المسلم في أحوال ومناسبات متنوعة"
    }

    articles_cards = [
      {
        title: "أحكام فصل الشتاء",
        description: "الإسلام دين شامل ، وهو يصوغ الحياة كلها لتكون حياة متصلة بخالقها، سامية في غاياتها، حكيمة في مفرداتها، ولهذا فإن للمؤمن في كل وقت عبادة تقوده إلى ذلك، وموسم الشتاء هو موسم لا يخلو من أحكام شرعية مرتبطة بأبواب عدة، في الطهارة والصلاة واللباس والمطر وغيرها، وسنتناول بإذن الله في هذه الوحدة شيئا من أحكامها.",
        img: "assets/img/almunasbat1.jpeg",
      },
      {
        title: "أحكام الرحلات",
        description: "الإسلام دين الحياة ، فهو مرتبط بكافة أحوال الإنسان، في حله وترحاله، وسكونه وحركته، وجده ولهوه، والرحلات جزء من هذه الحياة الاجتماعية، وهي كذلك لا تخلو من أحكام لأشياء يريد الله تعالى منا أن نستحضرها ونفعلها، أو من أشياء يريد الله تعالى أن نجتنبها ونتركها  وسنتناول بإذن الله في هذه الوحدة شيئا من أحكام الرحلات.",
        img: "assets/img/almunasba2.jpg",
      },
      {
        title: "الأوبئة و الاأمراض",
        description: "الابتلاء بالأوبئة من أقدار الله التي تنزل بالناس مسلمهم وكافرهم، لكن حال المسلم مع البلاء ليس كحال غيره، فهو يتعامل معه بما أمره ربه تعالى من الصبر وبذل الأسباب المشروعة في دفعه قبل وقوعه والاستشفاء منه إذا نزل به.",
        img: "assets/img/almunasbat3.jpg",
      },
    ];
  } 
  
  //====================================al3keda data ========================
  else if (topicName === 'al3keda') {
    article_title = {
      title: "العقيدة",
      description: "الإسلام عقيدة وشريعة، والعقيدة هي الأساس الذي يقوم عليه الدين، وعقيدة الإسلام عقيدة واضحة سهلة، توافق العقول الصحيحة والفِطَر السليمة."
    }

    articles_cards = [
      {
        title: "الشهادتان",
        description: 'جعل الإسلام لكلمة التوحيد لا إله إلا الله أعظم المكانة وأجلها؛ فهي أول واجب على المسلم فمن أراد الدخول في الإسلام فعليه أن يعتقدها ويتلفظ بها. ومن قالها موقناً بها يبتغي بذلك وجه الله كانت سبباً في نجاته من النار كما قال النبي صلى الله عليه وسلم: "فإن الله حرم على النار من قال لا إله إلا الله يبتغي بذلك وجه الله" (البخاري 415).',
        img: "assets/img/al3keda1.jpg",
      },
      {
        title: "الإيمان",
        description: "اتفقت جميع رسالات الأنبياء لأقوامهم على عبادة الله وحده لا شريك له والكفر بما يعبد من دون الله وهذا هو حقيقة معنى كلمة التوحيد، وهي الكلمة التي يدخل بها المرء في دين الله.",
        img: "assets/img/al3keda2.jpg",
      },
      {
        title: "العبادة",
        description: "العبادة هي: الطاعة المطلَقة مع المحبة والتعظيم والخضوع، وهي حقّ الله على عباده، يختصّ بها وحده دون سواه ، وتشمل كل ما يحبّه الله ويرضاه من الأقوال والأعمال التي أمر بها وندب الناس إليها، سواء أكانت من الأعمال الظاهرة كالصلاة والزكاة والحج، أم من الأعمال الباطنة مثل ذكر الله بالقلب والخوف منه، والتوكل عليه، والاستعانة به، وغير ذلك.",
        img: "assets/img/al3keda3.jpg",
      },
    ];
  } 
  //====================================alquran data ========================
  else if (topicName === 'alquran') {
    article_title = {
      title: "القرآن الكريم",
      description: "أنزل الله عز وجل القرآن على خير خلقه وخاتم أنبيائه محمد ﷺ لهداية البشر وإخراجهم من الظلمات إلى النور، قال تعالى: ﴿قَدْ جَاءَكُمْ مِنَ اللهِ نُورٌ وَكِتَابٌ مُبِينٌ * يَهْدِي بِهِ اللهُ مَنِ اتَّبَعَ رِضْوَانَهُ سُبُلَ السَّلامِ وَيُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِهِ وَيَهْدِيهِمْ إِلَى صِرَاطٍ مُسْتَقِيمٍ﴾ [المائدة: 15، 16]."
    }

    articles_cards = [
      {
        title: "القرآن الكريم",
        description: "تهدف هذه الموضوعات إلى أن يكون المتعلم قادرًا على تصوُّر حقيقة القرآن الكريم وفضائله، عارفاً بأحكامه وآدابه وكيفية تفسير مفرداته.",
        img: "assets/img/alquran.jpg",
      },
    ];
  } 
  //====================================alsuna data ========================
  else if (topicName === 'alsuna') {
    article_title = {
      title: "السنة النبوية",
      description: "سنة رَسُول الله ﷺ وَحي أوحاه الله إِلَى نبيه مُحَمَّد ﷺ، وَهِي مَعَ كتاب الله الْعَزِيز أساس الدّين الإسلامي ومصدره، وهما مَعًا متلازمان تلازم شَهَادَة أَن لَا إِلَه إِلَّا الله وَشَهَادَة أَن مُحَمَّدًا رَسُول الله، وَمن لم يُؤمن بِالسنةِ لم يُؤمن بِالْقُرْآنِ."
    }

    articles_cards = [
      {
        title: "النبي ﷺ",
        description: "التعرف على شخصية الرسول ﷺ و سيرته و نبوته و حقوقه على أمته.",
        img: "assets/img/alsuna1.jpg",
      },
      {
        title: "الحديث و السنة",
        description: "معرفة فضل السنة، و مصدريّتها للتشريع، ومعرفة أهم كتبها.",
        img: "assets/img/alsuna2.jpg",
      },
    ];
  } 
  //====================================almu3amlat data ========================
  else if (topicName === 'almu3amlat') {
    article_title = {
      title: "المعاملات",
      description: "الأحكام الشرعية العملية التي تنظم أفعال المكلف وعلاقة الشخص بالغير، فيشمل علاقة المسلم بمن وافقه أو خالفه في الدين، والأحكام المدنية، والشخصية، والمعاملات المالية، والعقود وغير ذلك."
    }

    articles_cards = [
      {
        title: "المعاملات المالية",
        description: "",
        img: "assets/img/almu3amlat1.jpg",
      },
      {
        title: "المرأة المسلمة",
        description: "",
        img: "assets/img/almu3amlat2.jpg",
      },
      {
        title: "الأسرة المسلمة",
        description: "",
        img: "assets/img/almu3amlat3.jpg",
      },
    ];
  }

  displayArticles();
}

function displayArticles() {
  const mainCont = document.getElementById("mainArticleContainer")
  const articlesCont = document.getElementById("articlesContainer");

  mainCont.innerHTML = "";
  articlesCont.innerHTML = "";

  mainCont.innerHTML = `<h3 class="fs-2 fw-bold">${article_title.title}</h3>
                        <p>${article_title.description}</p>`;

  articles_cards.forEach(lesson => {
    articlesCont.innerHTML += `
      <div class="col-12 my-3">
        <div class="articles-card">
          <img src="${lesson.img}" class="w-100" alt="${lesson.title}">
          <div class="articles-card-text p-4">
            <h5 class="fw-bold mb-3">${lesson.title}</h5>
            <p>${lesson.description}</p>
            <button><a href="#">حجز الدرس الآن</a></button>
          </div>
        </div>
      </div>
    `;
  });
};

showArticle(topic);


